member/controllers/NotificationController.php

UPDATE `notification` SET `is_seen`=TRUE WHERE `id` IN ('7477', '7451', '7427', '7403', '7382', '7339', '7289', '6872', '6782', '6741', '6724', '6674', '6659', '6650', '6641', '6537', '6530', '6523', '6516', '6509', '6502', '6495', '6488', '6481', '6474', '6453', '6444', '6435', '6417', '6410', '6235', '6228', '6197', '6182', '6178', '6174', '6170', '6166', '6162', '6158', '6149', '6145', '6141', '6137', '6133', '6129', '6125', '6119', '5997', '5989')
---
    public function actionGetNotifications() {
        $collection = [];
        $notificationIds = [];
        $employee = new \common\models\Employee();

        try {
            $result = Notification::getByEmployeeId(Yii::$app->user->identity->id, Yii::$app->request->post('currentPage'));
            if ($result['notification']) {
                foreach ($result['notification'] as $notification) {
                    $notificationIds[] = $notification['id'];
                    $employee->firstname = $notification['firstname'];
                    $employee->lastname = $notification['lastname'];
                    $employee->profile_image_path = $notification['profile_image_path'];
                    $collection[] = [
                        'url' => $this->_makeUrlFromId($notification),
                        'avatar' => $employee->image,
                        'employee_name' => $employee->fullname,
                        'activity_action' => $this->_changeActivityTypeToText($notification['type']),
                        'activity_object' => $this->_getActivityName($notification),
                        'datetime_created' => $notification['datetime_created'],
                    ];
                }
            }

            //Update is_seen.
            if (!empty($notificationIds)) {
                Notification::updateAll(['is_seen'=> Notification::VAL_TRUE], ['id' => $notificationIds]);